# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import re

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
num_1 = pd.Series(np.random.randint(1,5,100))
num_2 = pd.Series(np.random.randint(1,4,100))
num_3 = pd.Series(np.random.randint(10000,30001,100))

In [3]:
num_1,num_2,num_3

(0     1
 1     4
 2     2
 3     2
 4     1
      ..
 95    3
 96    2
 97    1
 98    3
 99    2
 Length: 100, dtype: int64,
 0     2
 1     1
 2     3
 3     1
 4     1
      ..
 95    1
 96    2
 97    1
 98    1
 99    3
 Length: 100, dtype: int64,
 0     15510
 1     14128
 2     27210
 3     17719
 4     21756
       ...
 95    12805
 96    28601
 97    20061
 98    15666
 99    22672
 Length: 100, dtype: int64)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
data = {
    'num_1' : num_1,
    'num_2' : num_2,
    'num_3' : num_3
    
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df.head()

   num_1  num_2  num_3
0      1      2  15510
1      4      1  14128
2      2      3  27210
3      2      1  17719
4      1      1  21756

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
df = df.rename(columns = {
    'num_1':'bedrs',
    'num_2':'bathrs',
    'num_3': 'price_sqr_meter'
})

In [8]:
df

    bedrs  bathrs  price_sqr_meter
0       1       2            15510
1       4       1            14128
2       2       3            27210
3       2       1            17719
4       1       1            21756
..    ...     ...              ...
95      3       1            12805
96      2       2            28601
97      1       1            20061
98      3       1            15666
99      2       3            22672

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [9]:
bigcolumn = pd.concat([num_1,num_2,num_3],axis = 0)

In [10]:
bigcolumn

0         1
1         4
2         2
3         2
4         1
      ...
95    12805
96    28601
97    20061
98    15666
99    22672
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [11]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [12]:
df_1 = pd.DataFrame(bigcolumn).reset_index(drop = True)

In [13]:
df_1

         0
0        1
1        4
2        2
3        2
4        1
..     ...
295  12805
296  28601
297  20061
298  15666
299  22672

[300 rows x 1 columns]